app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "created_at", "updated_at", "book_id") VALUES (?, ?, ?, ?, ?)  [["comment", "眠眠打破"], ["user_id", 1], ["created_at", "2021-03-06 05:58:07.405537"], ["updated_at", "2021-03-06 05:58:07.405537"], ["book_id", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 1], ["book_id", 0], ["LIMIT", 1]]
---
  def create
    @book = Book.find(params[:book_id])
    @book_comment = current_user.book_comments.new(book_comment_params)
    @book_comment.book_id = @book.id
     @book_comments = @book.book_comments
    if @book_comment.save
      print(@book_comment.book_id)
      redirect_to book_path(@book.id)
    else
      @newbook = Book.new
      @book = Book.find(params[:book_id])